In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
dframe =DataFrame({'key1': ['A']*2+['B']*3,
                                      'kye2': [2,2,2,3,3]})
dframe

  key1  kye2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [4]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [6]:
dframe.drop_duplicates()

  key1  kye2
0    A     2
2    B     2
3    B     3

In [7]:
dframe.drop_duplicates(['key1'])

  key1  kye2
0    A     2
2    B     2

In [8]:
dframe

  key1  kye2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [9]:
dframe.drop_duplicates(['key1'], keep='last')

  key1  kye2
1    A     2
4    B     3